Infineon/AURIX_code_examples/code_examples/iLLD_TC387_ADS_GPT12_Incremental_Encoder_1/Libraries/Infra/Sfr/TC38x/IfxSbcu_bf.h
/** \brief Mask for Ifx_SBCU_ALCLR_Bits.CLR25 */
#define IFX_SBCU_ALCLR_CLR25_MSK (0x1u)

/** \brief Offset for Ifx_SBCU_ALCLR_Bits.CLR25 */
#define IFX_SBCU_ALCLR_CLR25_OFF (25u)

/** \brief Length for Ifx_SBCU_ALCLR_Bits.CLR26 */
#define IFX_SBCU_ALCLR_CLR26_LEN (1u)

/** \brief Mask for Ifx_SBCU_ALCLR_Bits.CLR26 */
#define IFX_SBCU_ALCLR_CLR26_MSK (0x1u)

/** \brief Offset for Ifx_SBCU_ALCLR_Bits.CLR26 */
#define IFX_SBCU_ALCLR_CLR26_OFF (26u)

/** \brief Length for Ifx_SBCU_ALCLR_Bits.CLR27 */
#define IFX_SBCU_ALCLR_CLR27_LEN (1u)

/** \brief Mask for Ifx_SBCU_ALCLR_Bits.CLR27 */
#define IFX_SBCU_ALCLR_CLR27_MSK (0x1u)

/** \brief Offset for Ifx_SBCU_ALCLR_Bits.CLR27 */
#define IFX_SBCU_ALCLR_CLR27_OFF (27u)

/** \brief Length for Ifx_SBCU_ALCLR_Bits.CLR28 */
#define IFX_SBCU_ALCLR_CLR28_LEN (1u)

/** \brief Mask for Ifx_SBCU_ALCLR_Bits.CLR28 */
#define IFX_SBCU_ALCLR_CLR28_MSK (0x1u)

/** \brief Offset for Ifx_SBCU_ALCLR_Bits.CLR28 */
#define IFX_SBCU_ALCLR_CLR28_OFF (28u)

/** \brief Length for Ifx_SBCU_ALCLR_Bits.CLR29 */
#define IFX_SBCU_ALCLR_CLR29_LEN (1u)

/** \brief Mask for Ifx_SBCU_ALCLR_Bits.CLR29 */
#define IFX_SBCU_ALCLR_CLR29_MSK (0x1u)

/** \brief Offset for Ifx_SBCU_ALCLR_Bits.CLR29 */
#define IFX_SBCU_ALCLR_CLR29_OFF (29u)

/** \brief Length for Ifx_SBCU_ALCLR_Bits.CLR30 */
#define IFX_SBCU_ALCLR_CLR30_LEN (1u)

/** \brief Mask for Ifx_SBCU_ALCLR_Bits.CLR30 */
#define IFX_SBCU_ALCLR_CLR30_MSK (0x1u)

/** \brief Offset for Ifx_SBCU_ALCLR_Bits.CLR30 */
#define IFX_SBCU_ALCLR_CLR30_OFF (30u)

/** \brief Length for Ifx_SBCU_ALCLR_Bits.CLR31 */
#define IFX_SBCU_ALCLR_CLR31_LEN (1u)

/** \brief Mask for Ifx_SBCU_ALCLR_Bits.CLR31 */
#define IFX_SBCU_ALCLR_CLR31_MSK (0x1u)

/** \brief Offset for Ifx_SBCU_ALCLR_Bits.CLR31 */
#define IFX_SBCU_ALCLR_CLR31_OFF (31u)

/** \brief Length for Ifx_SBCU_ALCTRL_Bits.ALOV */
#define IFX_SBCU_ALCTRL_ALOV_LEN (1u)

/** \brief Mask for Ifx_SBCU_ALCTRL_Bits.ALOV */
#define IFX_SBCU_ALCTRL_ALOV_MSK (0x1u)

/** \brief Offset for Ifx_SBCU_ALCTRL_Bits.ALOV */
#define IFX_SBCU_ALCTRL_ALOV_OFF (0u)

/** \brief Length for Ifx_SBCU_ALCTRL_Bits.ALOVCLR */
#define IFX_SBCU_ALCTRL_ALOVCLR_LEN (1u)

/** \brief Mask for Ifx_SBCU_ALCTRL_Bits.ALOVCLR */
#define IFX_SBCU_ALCTRL_ALOVCLR_MSK (0x1u)

/** \brief Offset for Ifx_SBCU_ALCTRL_Bits.ALOVCLR */
#define IFX_SBCU_ALCTRL_ALOVCLR_OFF (1u)

/** \brief Length for Ifx_SBCU_FEGEN_Bits.SEDM */
#define IFX_SBCU_FEGEN_SEDM_LEN (3u)

/** \brief Mask for Ifx_SBCU_FEGEN_Bits.SEDM */
#define IFX_SBCU_FEGEN_SEDM_MSK (0x7u)

/** \brief Offset for Ifx_SBCU_FEGEN_Bits.SEDM */
#define IFX_SBCU_FEGEN_SEDM_OFF (0u)

/** \brief Length for Ifx_SBCU_FEGEN_Bits.MEDM */
#define IFX_SBCU_FEGEN_MEDM_LEN (3u)

/** \brief Mask for Ifx_SBCU_FEGEN_Bits.MEDM */
#define IFX_SBCU_FEGEN_MEDM_MSK (0x7u)

/** \brief Offset for Ifx_SBCU_FEGEN_Bits.MEDM */
#define IFX_SBCU_FEGEN_MEDM_OFF (8u)

/** \brief Length for Ifx_SBCU_FEGEN_Bits.EN */
#define IFX_SBCU_FEGEN_EN_LEN (3u)

/** \brief Mask for Ifx_SBCU_FEGEN_Bits.EN */
#define IFX_SBCU_FEGEN_EN_MSK (0x7u)

/** \brief Offset for Ifx_SBCU_FEGEN_Bits.EN */
#define IFX_SBCU_FEGEN_EN_OFF (16u)

/** \brief Length for Ifx_SBCU_FEGEN_Bits.BCU */
#define IFX_SBCU_FEGEN_BCU_LEN (2u)

/** \brief Mask for Ifx_SBCU_FEGEN_Bits.BCU */
#define IFX_SBCU_FEGEN_BCU_MSK (0x3u)

/** \brief Offset for Ifx_SBCU_FEGEN_Bits.BCU */
#define IFX_SBCU_FEGEN_BCU_OFF (24u)

/** \brief Length for Ifx_SBCU_ACCEN0_Bits.EN0 */
#define IFX_SBCU_ACCEN0_EN0_LEN (1u)

/** \brief Mask for Ifx_SBCU_ACCEN0_Bits.EN0 */
#define IFX_SBCU_ACCEN0_EN0_MSK (0x1u)

/** \brief Offset for Ifx_SBCU_ACCEN0_Bits.EN0 */
#define IFX_SBCU_ACCEN0_EN0_OFF (0u)

/** \brief Length for Ifx_SBCU_ACCEN0_Bits.EN1 */
#define IFX_SBCU_ACCEN0_EN1_LEN (1u)

/** \brief Mask for Ifx_SBCU_ACCEN0_Bits.EN1 */
#define IFX_SBCU_ACCEN0_EN1_MSK (0x1u)

/** \brief Offset for Ifx_SBCU_ACCEN0_Bits.EN1 */
#define IFX_SBCU_ACCEN0_EN1_OFF (1u)

/** \brief Length for Ifx_SBCU_ACCEN0_Bits.EN2 */
#define IFX_SBCU_ACCEN0_EN2_LEN (1u)

/** \brief Mask for Ifx_SBCU_ACCEN0_Bits.EN2 */
#define IFX_SBCU_ACCEN0_EN2_MSK (0x1u)

/** \brief Offset for Ifx_SBCU_ACCEN0_Bits.EN2 */
#define IFX_SBCU_ACCEN0_EN2_OFF (2u)

/** \brief Length for Ifx_SBCU_ACCEN0_Bits.EN3 */
#define IFX_SBCU_ACCEN0_EN3_LEN (1u)

/** \brief Mask for Ifx_SBCU_ACCEN0_Bits.EN3 */
#define IFX_SBCU_ACCEN0_EN3_MSK (0x1u)

/** \brief Offset for Ifx_SBCU_ACCEN0_Bits.EN3 */
#define IFX_SBCU_ACCEN0_EN3_OFF (3u)

/** \brief Length for Ifx_SBCU_ACCEN0_Bits.EN4 */
#define IFX_SBCU_ACCEN0_EN4_LEN (1u)

/** \brief Mask for Ifx_SBCU_ACCEN0_Bits.EN4 */
#define IFX_SBCU_ACCEN0_EN4_MSK (0x1u)

/** \brief Offset for Ifx_SBCU_ACCEN0_Bits.EN4 */
#define IFX_SBCU_ACCEN0_EN4_OFF (4u)

/** \brief Length for Ifx_SBCU_ACCEN0_Bits.EN5 */
#define IFX_SBCU_ACCEN0_EN5_LEN (1u)

/** \brief Mask for Ifx_SBCU_ACCEN0_Bits.EN5 */
#define IFX_SBCU_ACCEN0_EN5_MSK (0x1u)

/** \brief Offset for Ifx_SBCU_ACCEN0_Bits.EN5 */
#define IFX_SBCU_ACCEN0_EN5_OFF (5u)

/** \brief Length for Ifx_SBCU_ACCEN0_Bits.EN6 */
#define IFX_SBCU_ACCEN0_EN6_LEN (1u)

/** \brief Mask for Ifx_SBCU_ACCEN0_Bits.EN6 */
#define IFX_SBCU_ACCEN0_EN6_MSK (0x1u)

/** \brief Offset for Ifx_SBCU_ACCEN0_Bits.EN6 */
#define IFX_SBCU_ACCEN0_EN6_OFF (6u)

/** \brief Length for Ifx_SBCU_ACCEN0_Bits.EN7 */
#define IFX_SBCU_ACCEN0_EN7_LEN (1u)

/** \brief Mask for Ifx_SBCU_ACCEN0_Bits.EN7 */
#define IFX_SBCU_ACCEN0_EN7_MSK (0x1u)

/** \brief Offset for Ifx_SBCU_ACCEN0_Bits.EN7 */
#define IFX_SBCU_ACCEN0_EN7_OFF (7u)

/** \brief Length for Ifx_SBCU_ACCEN0_Bits.EN8 */
#define IFX_SBCU_ACCEN0_EN8_LEN (1u)

/** \brief Mask for Ifx_SBCU_ACCEN0_Bits.EN8 */
#define IFX_SBCU_ACCEN0_EN8_MSK (0x1u)

/** \brief Offset for Ifx_SBCU_ACCEN0_Bits.EN8 */
#define IFX_SBCU_ACCEN0_EN8_OFF (8u)

/** \brief Length for Ifx_SBCU_ACCEN0_Bits.EN9 */
#define IFX_SBCU_ACCEN0_EN9_LEN (1u)

/** \brief Mask for Ifx_SBCU_ACCEN0_Bits.EN9 */
#define IFX_SBCU_ACCEN0_EN9_MSK (0x1u)

/** \brief Offset for Ifx_SBCU_ACCEN0_Bits.EN9 */
#define IFX_SBCU_ACCEN0_EN9_OFF (9u)

/** \brief Length for Ifx_SBCU_ACCEN0_Bits.EN10 */
#define IFX_SBCU_ACCEN0_EN10_LEN (1u)

/** \brief Mask for Ifx_SBCU_ACCEN0_Bits.EN10 */
#define IFX_SBCU_ACCEN0_EN10_MSK (0x1u)

/** \brief Offset for Ifx_SBCU_ACCEN0_Bits.EN10 */
#define IFX_SBCU_ACCEN0_EN10_OFF (10u)

/** \brief Length for Ifx_SBCU_ACCEN0_Bits.EN11 */
#define IFX_SBCU_ACCEN0_EN11_LEN (1u)

/** \brief Mask for Ifx_SBCU_ACCEN0_Bits.EN11 */
#define IFX_SBCU_ACCEN0_EN11_MSK (0x1u)

/** \brief Offset for Ifx_SBCU_ACCEN0_Bits.EN11 */
#define IFX_SBCU_ACCEN0_EN11_OFF (11u)

